Repository: KDE/kontrast
Catalog: po/*/kontrast.po
Languages: ar, eo, ia, ja, lt, ro, tr, uk

source: Font size %1px is bad with the current contrast
ar: حجم الخط %1 بكسل سيئ مع التباين الحالي
eo: Tipara grandeco %1px estas malbona kun la nuna kontrasto
ia: Dimension de Font %1px es mal con le contrasto currente
ja: フォントサイズ %1px は現在のコントラストで適していません
lt: %1 piks. šrifto dydis netinka naudoti su dabartiniu kontrastu
ro: Dimensiunea de font %1px e proastă cu contrastul actual
tr: Geçerli karşıtlığa %1 piksellik yazıtipi puntosu pek uymadı.
uk: Розмір шрифту у %1 пк не варто використовувати із поточною контрастністю

source: Font size %1px is good with the current contrast
ar: حجم الخط %1 بكسل جيد مع التباين الحالي
eo: Tipara grandeco %1px estas bona kun la nuna kontrasto
ia: Dimension de Font %1px es bon con le contrasto currente
ja: フォントサイズ %1px は現在のコントラストで適しています
lt: %1 piks. šrifto dydis gerai tinka naudoti su dabartiniu kontrastu
ro: Dimensiunea de font %1px e bună cu contrastul actual
tr: Geçerlik karşıtlıkla %1 piksellik yazıtipi puntosu iyi gidiyor.
uk: Розмір шрифту у %1 пк варто використовувати із поточною контрастністю

source: Font size %1px is perfect with the current contrast
ar: حجم الخط %1 بكسل مثالي مع التباين الحالي
eo: Tipara grandeco %1px estas perfekta kun la nuna kontrasto
ia: Dimension de Font %1px es perfecte con le contrasto currente
ja: フォントサイズ %1px は現在のコントラストでとても適しています
lt: %1 piks. šrifto dydis tobulai tinka naudoti su dabartiniu kontrastu
ro: Dimensiunea de font %1px e perfectă cu contrastul actual
tr: Geçerli karşıtlığa %1 piksellik yazıtipi puntosu tam uydu.
uk: Розмір шрифту у %1 пк чудово працює із поточною контрастністю

# @title
source: Kontrast
ar: تباين

# @title
source: A contrast checker application
ar: تطبيق مدقق التباين
eo: Apliko de kontrastokontrolilo
ia: Un application de verificator de contrasto
ja: コントラストチェック用のアプリケーション
lt: Kontrasto tikrintuvės programa
ro: Aplicație pentru verificat contrastul
tr: Bir karşıtlık denetimcisi uygulaması
uk: Програма для перевірки контрастності

# @info:credit
source: Carl Schwan
ar: كارل شوان

# @info:credit
source: Maintainer and creator
ar: الصائن والمنشئ
eo: Prizorganto kaj kreinto
ia: Mantenitor e creator
ja: メンテナーとクリエーター
lt: Prižiūrėtojas ir kūrėjas
ro: Responsabil și creator
tr: Yaratan ve bakımcı
uk: Супровідник і автор проєкту

# @info:credit
source: Wikipedia
ar: ويكيبيديا
eo: Vikipedio
ja: ウィキペディア
lt: Vikipedija
tr: Vikipedi
uk: Вікіпедія

# @info:credit
source: Text on the main page CC-BY-SA-4.0
ar: النص على الصفحة الرئيسة CC-BY-SA-4.0
eo: Teksto sur la ĉefpaĝo CC-BY-SA-4.0
ia: Texto sur le pagina principal CC-BY-SA-4.0
ja: メインページの文章は CC-BY-SA-4.0 です
lt: Tekstas pagrindiniame puslapyje CC-BY-SA-4.0
ro: Textul paginii principale CC-BY-SA-4.0
tr: Ana sayfadaki metin CC-BY-SA-4.0 ile lisanslanmıştır
uk: Текст на головній сторінці — CC-BY-SA-4.0

# @info:credit
source: Carson Black
ar: كارسون بلاك

# @info:credit
source: SQLite backend for favorite colors
ar: واجهة SQLite الخلفية للألوان المفضلة
eo: SQLite backend por plej ŝatataj koloroj
ia: Retroadministration de SQLite per colores favorite
ja: バックエンドの SQLite でお気に入りの色を管理
lt: Mėgstamų spalvų SQLite vidinė pusė
ro: Platformă SQLite pentru culori favorite
tr: Sık kullanılan renkler için SQLite arka ucu
uk: Модуль SQLite для улюблених кольорів

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Oliver Kellogg
ia: Giovanni Sora
ja: Lemon73
lt: Moo
ro: Sergiu Bivol
tr: Emir SARI
uk: Юрій Чорноіван

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: olivermkellogg@gmail.com
ia: g.sora@tiscali.it
ja: Lemonade.Flash.1164@gmail.com
ro: sergiu@cip.md
tr: emir_sari@icloud.com
uk: yurchor@ukr.net

# @title:menu
source: Favorite Colors
ar: الألوان المفضلة
eo: Plej Ŝatataj Koloroj
ia: Colores favorite
ja: お気に入りの色
lt: Mėgstamos spalvos
ro: Culori favorite
tr: Sık Kullanılan Renkler
uk: Улюблені кольори

# @action:tooltip
source: Remove
ar: أزل
eo: Forigi
ja: 削除
lt: Šalinti
ro: Elimină
tr: Kaldır
uk: Вилучити

# @action:button
source: Text: %1
ar: النص: %1
eo: Teksto: %1
ia: Texto: %1
ja: 文字: %1
lt: Tekstas: %1
tr: Metin: %1
uk: Текст: %1

# @action:button
source: Background: %1
ar: الخلفيّة: %1
eo: Fono: %1
ia: Fundo: %1
ja: 背景: %1
lt: Fonas: %1
ro: Fundal: %1
tr: Arka plan: %1
uk: Тло: %1

# @action:button
source: Apply
ar: طبّق
eo: Apliki
ia: Applica
lt: Taikyti
ro: Aplică
tr: Uygula
uk: Застосувати

# @info:inline
source: Background color copied to clipboard
ar: نُسخ لون الخلفية إلى الحافظة
eo: Fonkoloro kopiita al tondujo
ia: Color de fundo copiate a area de transferentia
ja: 背景色をクリップボードにコピーしました
lt: Fono spalva nukopijuota į iškarpinę
ro: Culoare fundal copiată în clipboard
tr: Arka plan rengi panoya kopyalandı
uk: Колір фону скопійовано до буфера обміну даними

# @info:inline
source: Text color copied to clipboard
ar: نُسخ لون النص إلى الحافظة
eo: Tekstokoloro kopiita al tondujo
ia: Color de texto copiate a area de transferentia
ja: 文字色をクリップボードにコピーしました
lt: Teksto spalva nukopijuota į iškarpinę
ro: Culoare text copiată în clipboard
tr: Metin rengi panoya kopyalandı
uk: Колір тексту скопійовано до буфера обміну даними

# @info:inline
source: Color copied to clipboard
ar: نُسخ اللون إلى الحافظة
eo: Koloro kopiita al tondujo
ia: Color copiate a area de transferentia
ja: 色をクリップボードにコピーしました
lt: Spalva nukopijuota į iškarpinę
ro: Culoare copiată în clipboard
tr: Renk panoya kopyalandı
uk: Колір скопійовано до буфера обміну даними

# @title:menu
source: Help
ar: مساعدة
eo: Helpo
ia: Adjuta
ja: ヘルプ
lt: Pagalba
ro: Ajutor
tr: Yardım
uk: Довідка

# @title:heading
source: Contrast
ar: التباين
eo: Kontrasto
ia: Contrasto
ja: コントラスト
lt: Kontrastas
tr: Karşıtlık
uk: Контрастність

source: Contrast is the difference in color between two objects that allows them to be distinguished. In visual perception of the real world, contrast is determined by the difference in the color and brightness of the object and other objects within the same field of view.
ar: التباين هو اختلاف اللون بين جسمين، مما يسمح بتمييزهما. في الإدراك البصري للعالم الحقيقي، يُحدَّد التباين باختلاف لون وسطوع الجسم عن الأجسام الأخرى في مجال الرؤية نفسه.
eo: Kontrasto estas la diferenco de koloro inter du objektoj, kiu permesas ilin distingi. En vida percepto de la reala mondo, kontrasto estas determinita per la diferenco en la koloro kaj brileco de la objekto kaj aliaj objektoj ene de la sama vidkampo.
ia: Contrasto es le differentia in color inter duo objectos que permitte lor a esser distinguite. In le perception visual del mundo real, contrasto es determinate per le differentia in le color e brillantia del objecto e altere objectos intra le mesme campo de vista.
ja: コントラストとは2つの物体を区別するための色の違いです。現実世界の視覚的認識は、物体や同じ視界内の異なる物体の色の違いや明度によって決定されます。
lt: Kontrastas yra spalvų skirtumas tarp dviejų objektų, kuris leidžia juos atskirti. Kalbant apie vaizdinį realaus pasaulio suvokimą, kontrastas yra nustatomas remiantis skirtumu tarp įvairių objektų spalvos ir šviesumo tame pačiame regėjimo lauke.
ro: Contrastul e diferența de culoare dintre două obiecte ce le face să se deosebească În percepția vizuală a lumii reale, contrastul e determinat de diferența de culoare și strălucire a obiectului și celorlalte obiecte din același câmp vizual.
tr: Karşıtlık, iki nesnenin birbirinden ayırt edilmesini sağlayan renkler arasındaki ayrımdır. Gerçek dünyanın görsel algılamasında, karşıtlık, nesnenin ve aynı görüş alanındaki diğer nesnelerin renk ve parlaklığındaki ayrım ile algılanır.
uk: Контрастність — різниця у кольорі двох об'єктів, яка робить їх відмінними один від одного. У реальному візуальному сприйнятті контрастність визначається відмінностями у кольорі та яскравості об'єкта та інших об'єктів у полі зору.

source: A contrast value of 21 indicates a perfect contrast (usually black on white), and a value of 0 indicate that the two colors are the same.
ar: تشير قيمة التباين 21 إلى تباين مثالي (عادةً أسود على أبيض)، وتشير قيمة 0 إلى أن اللونين متماثلان.
eo: Kontrasta valoro de 21 indikas perfektan kontraston (kutime nigra sur blanka), kaj valoro de 0 indikas ke la du koloroj estas samaj.
ia: Un valor de contrasto de 21 indica un contrasto perfecte (solitemente nigre sur blanc), e un valor de 0 indica que le duo colores es le mesme.
ja: 完璧なコントラスト (黒と白など) のときはコントラスト値が21で、2つの色が同一の時はコントラスト値が0となります。
lt: Kontrasto reikšmė, lygi 21, nurodo tobulą kontrastą (įprastai juodu ant balto), o reikšmė, lygi 0, nurodo, jog dvi spalvos yra vienodos.
ro: O valoare de 21 a contrastului indică contrast perfect (de obicei negru pe alb), iar o valoare de 0 indică că cele două culori coincid.
tr: 21’lik bir karşıtlık değeri, genelde mükemmel bir karşıtlığı belirtirken (siyah ve beyaz), 0’lık bir değer ise iki rengin aynı olduğunu belirtir.
uk: Значення контрастності 21 вказує на ідеальну контрастність (зазвичай, чорне на білому), а значення 0 вказує на те, що два кольори є однаковими.

source: For normal text, the contrast ratio should be at least of 4.5 to conform to the WCAG AA standard and a contrast ratio of 7 or more is required to conform with the WCAG AAA standard.
ar: بالنسبة للنص العادي، يجب أن تكون نسبة التباين 4.5 على الأقل لتتوافق مع معيار WCAG AA، ويجب أن تكون نسبة التباين 7 أو أكثر لتتوافق مع معيار WCAG AAA.
eo: Por normala teksto, la kontrastoproporcio devus esti almenaŭ de 4.5 por konformiĝi al la WCAG AA-normo kaj kontrastoproporcio de 7 aŭ pli estas postulata por konformiĝi al la WCAG AAA-normo.
ia: Per un texto normal, le rata de contrasto deberea esser al minus de 4.5 per concordar con le standard WCAG AA e un rata de contrasto de 7 o plus es requirite per concordar con le standard WCAG AAA.
ja: 通常の文字では、WCAG 規格のレベル AA で最低 4.5 のコントラスト比が必要です。また、WCAG 規格のレベル AAA で最低 7 のコントラスト比が必要です。
lt: Įprasto teksto kontrasto santykis turėtų būti bent 4.5, kad atitiktų WCAG AA standartą, o kontrasto santykis, lygus 7 ar daugiau, yra būtinas, kad atitiktų WCAG AAA standartą.
ro: Pentru text normal, raportul de contrast ar trebui să fie cel puțin 4,5 pentru a se conforma standardului WCAG AA. Un raport de contrast de cel puțin 7 e necesar pentru conformitate cu standardul WCAG AAA.
tr: Normal metinde, WCAG AA standartına uyulabilmesi için karşıtlık oranı en az 4,5 olmalıdır ve WCAG AAA standartı içinse karşıtlık değeri en az 7 veya daha çok olmalıdır.
uk: Для звичайного тексту співвідношення контрастності має бути рівним принаймні 4,5 для сумісності зі стандартом WCAG AA, а співвідношення контрастності у 7 або більше потрібне для сумісності зі стандартом WCAG AAA.

source: For large text, the contrast ratio should be at least of 3 to conform to the WCAG AA standard and a contrast ratio of 4.5 or more is required to conform with the WCAG AAA standard.
ar: بالنسبة للنصوص الكبيرة، يجب أن تكون نسبة التباين 3 على الأقل لتتوافق مع معيار WCAG AA، ويجب أن تكون نسبة التباين 4.5 أو أكثر لتتوافق مع معيار WCAG AAA.
eo: Por granda teksto, la kontrastoproporcio devus esti almenaŭ de 3 por konformiĝi al la WCAG AA-normo kaj kontrastoproporcio de 4.5 aŭ pli estas postulata por konformiĝi al la WCAG AAA-normo.
ia: Per un texto grande, le rata de contrasto deberea esser al minus de 3 per concordar con le standard WCAG AA e un rata de contrasto de 4.5 o plus es requirite per concordar con le standard WCAG AAA.
ja: 大きい文字では、WCAG 規格のレベル AA で最低 3 のコントラスト比が必要です。また、WCAG 規格のレベル AAA で最低 4.5 のコントラスト比が必要です。
lt: Didelio teksto kontrasto santykis turėtų būti bent 3, kad atitiktų WCAG AA standartą, o kontrasto santykis, lygus 4.5 ar daugiau, yra būtinas, kad atitiktų WCAG AAA standartą.
ro: Pentru text mare, raportul de contrast ar trebui să fie cel puțin 3 pentru a se conforma standardului WCAG AA. Un raport de contrast de cel puțin 4,5 e necesar pentru conformitate cu standardul WCAG AAA.
tr: Büyük metinler için WCAG AA standartına uyulabilmesi için karşıtlık oranı en az 3 olmalıdır ve WCAG AAA standartı içinse karşıtlık değeri en az 4,5 veya daha çok olmalıdır.
uk: Для тексту великими літерами співвідношення контрастності має бути рівним принаймні 3 для сумісності зі стандартом WCAG AA, а співвідношення контрастності у 4,5 або більше потрібне для сумісності зі стандартом WCAG AAA.

source: Kontrast
ar: تباين

# @title:menu
source: Contrast Checker
ar: مدقق التباين
eo: Kontrolilo pri Kontrasto
ia: Verificator de contrasto
ja: コントラストチェッカー
lt: Kontrasto tikrintuvė
ro: Verificator de contrast
tr: Karşıtlık Denetimcisi
uk: Засіб для перевірки контрастності

# @title:menu
source: About
ar: عن
eo: Pri
ia: A proposito
ja: これは何？
lt: Apie
ro: Despre
tr: Hakkında
uk: Про програму

# @label
source: Contrast ratio: %1
ar: معدل التباين: %1
eo: Kontrastoproporcio: %1
ia: Rata de Contrasto: %1
ja: コントラスト比: %1
lt: Kontrasto santykis: %1
ro: Raport de contrast: %1
tr: Karşıtlık oranı: %1
uk: Коефіцієнт контрастності: %1

source: Perfect for normal and large text
ar: مثالي للنصوص العادية والكبيرة
eo: Perfekta por normala kaj granda teksto
ia: Perfecte per texto normal e grande
ja: 通常サイズと大きいサイズの文字にとても適しています
lt: Tobulai tinka įprastam ir dideliam tekstui
ro: Perfect pentru text normal și mare
tr: Normal ve büyük metin için mükemmel
uk: Ідеально для звичайних і великих розмірів текстів

source: Perfect for large text and good for normal text
ar: مثالي للنصوص الكبيرة وجيد للنصوص العادية
eo: Perfekta por granda teksto kaj bona por normala teksto
ia: Perfecte per texto grande e bon per texto normal
ja: 大きいサイズの文字にとても適していて、普通サイズの文字にも適しています
lt: Tobulai tinka dideliam tekstui ir gerai tinka įprastam tekstui
ro: Perfect pentru text mare și bun pentru text normal
tr: Büyük metin için mükemmel ve normal metin için iyi
uk: Ідеально для великих розмірів текстів та непогано для звичайних

source: Good for large text and bad for normal text
ar: جيد للنصوص الكبيرة وسيئ للنصوص العادية
eo: Bona por granda teksto kaj malbona por normala teksto
ia: Bon per texto grande e mal per texto normal
ja: 大きいサイズの文字に適していますが、通常サイズの文字に適していません
lt: Gerai tinka dideliam tekstui ir blogai tinka įprastam tekstui
ro: Bun pentru text mare și prost pentru text normal
tr: Büyük metin için iyi ve normal metin için kötü
uk: Добре для великих розмірів текстів і погано для звичайних

source: Bad for large and normal text
ar: سيئ للنصوص الكبيرة والعادية
eo: Malbona por granda kaj normala teksto
ia: Mal per texto grande e normal
ja: 大きいサイズと通常サイズの文字に適していません
lt: Blogai tinka dideliam ir įprastam tekstui
ro: Prost pentru text mare și normal
tr: Büyük ve normal metin için kötü
uk: Погано для великих та звичайних розмірів тексту

source: Contrast is the difference in luminance or color that makes an object (or its representation in an image or display) distinguishable. In visual perception of the real world, contrast is determined by the difference in the color and brightness of the object and other objects within the same field of view.
ar: التباين هو الفرق في السطوع أو اللون الذي يُميّز الجسم (أو تمثيله في صورة أو عرض). في الإدراك البصري للعالم الحقيقي، يُحدَّد التباين باختلاف لون وسطوع الجسم والأجسام الأخرى ضمن مجال الرؤية نفسه.
eo: Kontrasto estas la diferenco en lumeco aŭ koloro kiu igas objekton (aŭ ĝian reprezentadon en bildo aŭ ekrano) distingebla. En vida percepto de la reala mondo, kontrasto estas determinita per la diferenco en la koloro kaj brileco de la objekto kaj aliaj objektoj ene de la sama vidkampo.
ia: Contrasto es le differentia in luminantia o color que face un objecto (o su representation in unn imagine o un monstrator) distinguibile. In le perceprion visual del mundo real, contrasto es deteminate per le differentia in le color e brillantia del objecto e altere objectos intra le mesme campo de vista.
ja: コントラストは輝度や物体を構成する色 (または画像や表示の表現) の違いを判別できます。現実世界の視覚的認識は、物体や同じ視界内の異なる物体の色の違いや明度によって決定されます。
lt: Kontrastas – tai skirtumas tarp skaisčio ar spalvos, kuris padaro objektą (ar jo atvaizdavimą paveiksle ar ekrane) atskiriamą. Kalbant apie vaizdinį realaus pasaulio suvokimą, kontrastas yra nustatomas remiantis skirtumu tarp įvairių objektų spalvos ir šviesumo tame pačiame regėjimo lauke.
ro: Contrastul e diferența de luminanță sau culoare ce face un obiect (sau reprezentarea acestuia pe imagine sau ecran) vizibil. În percepția vizuală a lumii reale, contrastul e determinat de diferența de culoare și strălucire a obiectului și celorlalte obiecte din același câmp vizual.
tr: Karşıtlık, bir nesnenin (veya bir görüntü veya görseldeki temsilinin) ayırt edilebilir olmasını sağlayan parlaklık veya renk ayrımıdır. Gerçek dünyanın görsel algılamasında, karşıtlık, nesnenin ve aynı görüş alanındaki diğer nesnelerin renk ve parlaklığındaki ayrım ile algılanır.
uk: Контрастність — різниця в освітленості або кольорі, яка робить об'єкт (або його образ на зображенні або дисплеї) відмінним від фону. У реальному візуальному сприйнятті контрастність визначається відмінностями у кольорі та яскравості об'єкта та інших об'єктів у полі зору.

# @label
source: Text
ar: النص
eo: Teksto
ia: Texto
ja: 文字
lt: Tekstas
tr: Metin
uk: Текст

# @label
source: Hue: %1°
ar: التدرج: %1°
eo: Nuanco: %1°
ia: Tinta: %1°
ja: 色相: %1°
lt: Atspalvis: %1°
ro: Nuanță: %1°
tr: Renk tonu: %1°
uk: Відтінок: %1°

# @label
source: Saturation: %1
ar: التّشبّع: %1
eo: Saturiĝo: %1
ja: 彩度: %1
lt: Grynis: %1
ro: Saturație: %1
tr: Doygunluk: %1
uk: Насиченість: %1

# @label
source: Lightness: %1
ar: الخفة: %1
eo: Malpezeco: %1
ia: Brillantia: %1
ja: 明度: %1
lt: Šviesumas: %1
ro: Luminozitate: %1
tr: Açıklık: %1
uk: Освітленість: %1

# @label
source: Background
ar: الخلفيّة
eo: Fono
ia: Fundo
ja: 背景
lt: Fonas
ro: Fundal
tr: Arka plan
uk: Тло

# @label
source: Font size: %1px
ar: حجم الخط: %1 بكسل
eo: Tipar-grandeco: %1px
ia: Dimension de Font: %1px
ja: フォントサイズ: %1px
lt: Šrifto dydis: %1 piks.
ro: Dimensiune font: %1px
tr: Yazıtipi puntosu: %1 pks
uk: Розмір шрифту: %1пк

# @action:button
source: Invert
ar: اعكس
eo: Inverti
ia: Inverte
ja: 入れ替える
lt: Invertuoti
ro: Inversează
tr: Tersine Çevir
uk: Інвертувати

# @action:button
source: Randomize
ar: عشوائي
eo: Hazardigi
ia: Aleatori
ja: ランダム
lt: Atsitiktinė
ro: Amestecă
tr: Rastgeleleştir
uk: Випадково

# @action:button
source: Mark as Favorite
ar: فضّله
eo: Marki kiel Plej Ŝatatan
ia: Marca iste como Favorite
ja: お気に入りとしてマーク
lt: Žymėti kaip mėgstamą
ro: Marchează ca favorită
tr: Sık Kullanılanlara Ekle
uk: Додати до улюблених
